trade_exp/src/Documents/ПорчаТоваров/ПорчаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорчаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПриходоватьТоварыПоСебестоимостиСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентУценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2b90162-0de9-4ba3-8191-3343ac456458">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1de82408-fd44-4902-a127-615efb15ec61">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПодНазначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a93462a1-6dbb-448f-838d-9341e6b16bc0">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b61f9554-9e2a-4b02-9b30-30effaa6a205">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="12f17b4e-49b6-4c83-8443-9424e7ac6b1a">
      <name>АналитикаУчетаНоменклатурыОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач/ТоварыКОформлениюИзлишковНедостач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31f929cb-7f61-4c5e-9806-c9ea6e81e790">
  <name>ТоварыКОформлениюИзлишковНедостач</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="70a0786f-ecb4-490c-9859-a9080d6d314b">
    <name>КОформлениюАктов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="e5c15b48-6100-48e0-9566-fac00a7bf807">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="95310fd4-33c3-4a9b-93a5-949bd3f3d035">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a0a36430-a512-4369-af11-fbe78b5dad54">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="18d00fec-242d-4860-9e90-0e0fe20956fe">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6554474d-b5f8-457c-aa41-d997e29391b4">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0ddea113-0255-44dc-b29d-bf7c3ec10b59">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/ТоварыДругогоКачества/ТоварыДругогоКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3b2efd34-127e-4a07-89bd-a94f6887d402">
  <name>ТоварыДругогоКачества</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="86dfdd03-1d54-4567-a1fb-aec3906fe457">
    <name>ГрадацияКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="a82d1df6-c7b2-47f5-ade7-e61a5c7e16d6">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="06502c53-1382-4778-83ab-f65542e3581b">
    <name>НоменклатураБрак</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыПересчетовТоваров/СтатусыПересчетовТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПересчетовТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="688e1ea4-1165-44c7-82ae-6d12f51b7aa5">
    <name>Подготовлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2f76743d-d91e-4ad6-9315-9972509a3e14">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="adbdecd7-7147-4c89-9207-2c1d3c562caa">
    <name>ВнесениеРезультатов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7a6d2cd1-f59e-4f36-aee8-0dfbe3127c2e">
    <name>Выполнено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="40b327e9-803e-48ef-8649-52ab96822485">
    <name>Отменено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e1638101-0ac4-4b15-93ff-5c57eb1ae9b9">
    <name>Приостановлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОрдерНаОтражениеПорчиТоваров/ОрдерНаОтражениеПорчиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c23a5480-4ef3-461a-a350-1c98133bdb26">
  <name>ОрдерНаОтражениеПорчиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="55b567bd-5626-45ad-b372-21173d33e1c2">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b381face-f263-4829-b39c-41a34a656f44">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="707ee6b2-0e72-4780-828c-8ee015b98c11">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c77c1073-7ed9-4b56-89a8-b071d365b6a3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4c31aee-8206-4a0d-9361-d2a471fceb69">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8ad138c-3104-4741-aeeb-fb57ebb79758">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8c1167c7-85a5-4ca3-8802-e3dee77a76d1">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="052e0cb0-0000-4ddd-8a93-e840f2dbe73b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="770b1e51-71e9-4a36-9488-e7a2697bccb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f81acb2-ffed-47ef-a72f-2f85ae37c160">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="22f7ffae-bef9-468e-ab74-a9f28d48668b">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7ff7a9e2-271e-4868-822f-ad043715c2c2">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ecb09229-295f-4a5f-b39a-dc6800d37d19">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c20314ed-03be-42fe-b8b3-5d5a6ae459ac">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="383f0574-0e1d-4f71-9b06-219cf8db727e">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4a936e6c-a248-4d8c-8f93-03f293a6e34e">
      <name>ПодНазначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08aad01b-cdf3-41d8-b90c-ab15f6da0b72">
      <name>УпаковкаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbc30293-7d8b-4eb8-b447-b082ecb78504">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6c05ea0d-3aba-45ee-b588-7e1c0b5aba33">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПорчаТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	&После("ОбработкаПроведения")
	Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
		Если ЗначениеЗаполнено(ЭтотОбъект.ПересчетТоваров) Тогда 
			ДопМодульСервер.КонтрольОстатковПоПересчетам(Ссылка,Отказ); 
		КонецЕсли ; 
	КонецПроцедуры
	
	&После("ПриЗаписи")
	Процедура Док_ПриЗаписи(Отказ)
		
		Если ЭтотОбъект.ПометкаУдаления Тогда
			
			Если Альтерра_СкладСервер.ПоАктуСуществуетОрдерНаОтражение(Ссылка) Тогда
				Сообщить("Документ нельзя пометить на удаление, так как по нему создан ордер на отражение!");
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецПроцедуры
	
	&ИзменениеИКонтроль("ОбработкаЗаполнения")
	Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
		ДокументОснование = Неопределено;
		ЗаполнитьТабличнуюЧастьТовары = Истина;
		#Вставка
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда	
			ДокументОснование =ДанныеЗаполнения.Ссылка;
			Склад = ДанныеЗаполнения.СкладПолучатель; 
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		    Склад = ДанныеЗаполнения.Склад;
			Подразделение = ДанныеЗаполнения.Склад.Подразделение;
			АналитикаДоходов = ДанныеЗаполнения.Склад.Подразделение;
			АналитикаРасходов = ДанныеЗаполнения.Склад.Подразделение;
		КонецЕсли;
		#КонецВставки
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
			ЗаполнитьТабличнуюЧастьТовары = НЕ ДанныеЗаполнения.Свойство("НеЗаполнятьТаблинуюЧастьТовары");
			
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))
			И ДанныеЗаполнения <> Неопределено Тогда
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда 
				СтруктураРезультат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Статус, Склад");
				Если СтруктураРезультат.Статус <> Перечисления.СтатусыПересчетовТоваров.Выполнено Тогда 
					ТекстСообщения = НСтр("ru='Документ ""%ДокументПересчет%"" находится в статусе ""%СтатусПересчета%"". Ввод документа ""%ДокументАкт%"" на основании разрешен только в статусе ""%СтатусВыполнено%"".'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументПересчет%", ДанныеЗаполнения);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументАкт%", Метаданные.Документы.ПорчаТоваров.Синоним);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусВыполнено%", Перечисления.СтатусыПересчетовТоваров.Выполнено);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусПересчета%", СтруктураРезультат.Статус);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
				Склад = СтруктураРезультат.Склад;
				ПересчетТоваров = ДанныеЗаполнения;
				
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПорчаТоваров") Тогда
				
				ЗаполнитьТабличнуюЧастьТовары = Ложь;
				
				ИсправлениеДокументов.ЗаполнитьИсправление(ЭтотОбъект, ДанныеЗаполнения);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Склад) Тогда
				Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Склад");
			КонецЕсли;
			
			ДокументОснование = ДанныеЗаполнения;
			
		КонецЕсли;
		
		// Выбор статей и аналитик.
		ПараметрыВыбораСтатейИАналитик = Документы.ПорчаТоваров.ПараметрыВыбораСтатейИАналитик(
		ХозяйственнаяОперация, ПриходоватьТоварыПоСебестоимостиСписания);
		ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
		
		ИнициализироватьДокумент(ДанныеЗаполнения);
		
		Если ЗаполнитьТабличнуюЧастьТовары Тогда 
			ЗаполнитьТабличнуюЧастьТовары(ДокументОснование);
		КонецЕсли;
		
		ПорчаТоваровЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
		#Вставка
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда	
			ПерезаполнитьТабЧастьПоАкту(ДокументОснование); 
		КонецЕсли;
		#КонецВставки
	КонецПроцедуры
	
	Процедура ПерезаполнитьТабЧастьПоАкту(ДокументОснование) 
		ТоварыИзПорчи = Товары.Выгрузить();
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ТоварыИзПорчи.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ТоварыИзПорчи.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	ТоварыИзПорчи.Характеристика КАК Характеристика,
		|	ТоварыИзПорчи.Номенклатура КАК Номенклатура,
		|	ТоварыИзПорчи.Количество КАК Количество,
		|	ТоварыИзПорчи.Цена КАК Цена,
		|	ТоварыИзПорчи.Серия КАК Серия,
		|	ТоварыИзПорчи.Назначение КАК Назначение,
		|	ТоварыИзПорчи.ПодНазначение КАК ПодНазначение
		|ПОМЕСТИТЬ ТоварыИзПорчи
		|ИЗ
		|	&ТоварыИзПорчи КАК ТоварыИзПорчи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыИзПорчи.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	ТоварыИзПорчи.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ТоварыИзПорчи.Характеристика КАК Характеристика,
		|	ТоварыИзПорчи.Номенклатура КАК Номенклатура,
		|	АктОРасхожденияхПослеПеремещенияТовары.КоличествоУпаковок - АктОРасхожденияхПослеПеремещенияТовары.КоличествоУпаковокПоДокументу КАК Количество,
		|	ТоварыИзПорчи.Цена КАК Цена,
		|	ТоварыИзПорчи.Серия КАК Серия,
		|	ТоварыИзПорчи.Назначение КАК Назначение,
		|	ТоварыИзПорчи.ПодНазначение КАК ПодНазначение
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктОРасхожденияхПослеПеремещенияТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыИзПорчи КАК ТоварыИзПорчи
		|		ПО АктОРасхожденияхПослеПеремещенияТовары.Номенклатура = ТоварыИзПорчи.НоменклатураОприходование
		|			И АктОРасхожденияхПослеПеремещенияТовары.Характеристика = ТоварыИзПорчи.ХарактеристикаОприходование
		|ГДЕ
		|	АктОРасхожденияхПослеПеремещенияТовары.Ссылка = &Акт"; 
		
		Запрос.УстановитьПараметр("Акт", документОснование); 
		Запрос.УстановитьПараметр("ТоварыИзПорчи", ТоварыИзПорчи); 
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Товары.Очистить();
		Товары.Загрузить(Выгрузка);
		
	КонецПроцедуры
	
	&ИзменениеИКонтроль("ЗаполнитьТабличнуюЧастьТовары")
	Процедура Док_ЗаполнитьТабличнуюЧастьТовары(ДокументОснование = Неопределено) 
		
		Запрос = Новый Запрос;
		
		ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(Склад);
		
		Если ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда 
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Склад", Склад);
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			НаОснованииПересчета = ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПересчетТоваров");
			Запрос.УстановитьПараметр("НаОснованииПересчета", НаОснованииПересчета);
			НаОснованииОрдера = ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОрдерНаОтражениеПорчиТоваров");
			Запрос.УстановитьПараметр("НаОснованииОрдера", НаОснованииОрдера);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТоварыКОформлению.Номенклатура КАК Номенклатура,
			|	ТоварыКОформлению.Характеристика КАК Характеристика,
			|	ТоварыКОформлению.Серия КАК Серия,
			|	ТоварыКОформлению.Назначение КАК Назначение,
			|	ТоварыКОформлению.КОформлениюАктовОстаток КАК Количество
			|ПОМЕСТИТЬ ТаблицаБрака
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТоварыКОформлению.Номенклатура КАК Номенклатура,
			|		ТоварыКОформлению.Характеристика КАК Характеристика,
			|		ТоварыКОформлению.Серия КАК Серия,
			|		ТоварыКОформлению.Назначение КАК Назначение,
			|		ТоварыКОформлению.КОформлениюАктовОстаток КАК КОформлениюАктовОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Остатки(, Склад = &Склад) КАК ТоварыКОформлению
			|	ГДЕ
			|		ТоварыКОформлению.КОформлениюАктовОстаток > 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыКОформлению.Номенклатура,
			|		ТоварыКОформлению.Характеристика,
			|		ТоварыКОформлению.Серия,
			|		ТоварыКОформлению.Назначение,
			|		ТоварыКОформлению.КОформлениюАктов
			|	ИЗ
			|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлению
			|	ГДЕ
			|		ТоварыКОформлению.Регистратор = &Ссылка
			|		И ТоварыКОформлению.Активность = ИСТИНА
			|		И ТоварыКОформлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ТоварыКОформлению
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаБрака.Номенклатура,
			|	ТаблицаБрака.Характеристика,
			|	ЕСТЬNULL(ВЫБОР
			|		КОГДА &НаОснованииПересчета
			|			ТОГДА ПересчетТоваровТовары.Серия
			|		КОГДА &НаОснованииОрдера
			|			ТОГДА ОрдерНаОтражениеПорчиТоваровТовары.Серия
			|		ИНАЧЕ NULL
			|	КОНЕЦ, ТаблицаБрака.Серия) КАК Серия,
			|	ТаблицаБрака.Назначение КАК Назначение,
			|	ТаблицаБрака.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаБракаСФильтром
			|ИЗ
			|	ТаблицаБрака КАК ТаблицаБрака
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
			|		ПО (&НаОснованииПересчета)
			|			И ТаблицаБрака.Номенклатура = ПересчетТоваровТовары.Номенклатура
			|			И ТаблицаБрака.Характеристика = ПересчетТоваровТовары.Характеристика
			|			И ТаблицаБрака.Назначение = ПересчетТоваровТовары.Назначение
			|			И (ПересчетТоваровТовары.СтатусУказанияСерий <> 14
			|				ИЛИ ТаблицаБрака.Серия = ПересчетТоваровТовары.Серия)
			#Удаление
			|			И (ПересчетТоваровТовары.Количество <> ПересчетТоваровТовары.КоличествоФакт)
			#КонецУдаления
			#Вставка
			|			И (&НовыйРасчетОтклоненияБезУпаковок <> 0)
			#КонецВставки		
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОрдерНаОтражениеПорчиТоваров.Товары КАК ОрдерНаОтражениеПорчиТоваровТовары
			|		ПО (&НаОснованииОрдера)
			|			И ТаблицаБрака.Номенклатура = ОрдерНаОтражениеПорчиТоваровТовары.НоменклатураОприходование
			|			И ТаблицаБрака.Характеристика = ОрдерНаОтражениеПорчиТоваровТовары.ХарактеристикаОприходование
			|			И (ВЫБОР
			|				КОГДА ОрдерНаОтражениеПорчиТоваровТовары.ПодНазначение
			|					ТОГДА ТаблицаБрака.Назначение = ОрдерНаОтражениеПорчиТоваровТовары.Назначение
			|				ИНАЧЕ ТаблицаБрака.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|			КОНЕЦ)
			|			И (ОрдерНаОтражениеПорчиТоваровТовары.СтатусУказанияСерий <> 14
			|				ИЛИ ТаблицаБрака.Серия = ОрдерНаОтражениеПорчиТоваровТовары.Серия)
			|ГДЕ
			|	(НЕ &НаОснованииПересчета
			|			ИЛИ &НаОснованииПересчета
			|				И НЕ ПересчетТоваровТовары.Номенклатура ЕСТЬ NULL 
			|				И ПересчетТоваровТовары.Ссылка = &ДокументОснование)
			|	И (НЕ &НаОснованииОрдера
			|			ИЛИ &НаОснованииОрдера
			|				И НЕ ОрдерНаОтражениеПорчиТоваровТовары.НоменклатураОприходование ЕСТЬ NULL 
			|				И ОрдерНаОтражениеПорчиТоваровТовары.Ссылка = &ДокументОснование)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыКОформлению.Номенклатура КАК Номенклатура,
			|	ТоварыКОформлению.Характеристика КАК Характеристика,
			|	ТоварыКОформлению.Серия КАК Серия,
			|	ТоварыКОформлению.Назначение КАК Назначение,
			|	СУММА(ТоварыКОформлению.КОформлениюАктовОстаток) КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсходногоТовара
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТоварыКОформлению.Номенклатура КАК Номенклатура,
			|		ТоварыКОформлению.Характеристика КАК Характеристика,
			|		ТоварыКОформлению.Назначение КАК Назначение,
			|		-ТоварыКОформлению.КОформлениюАктовОстаток КАК КОформлениюАктовОстаток,
			|		ТоварыКОформлению.Серия КАК Серия
			|	ИЗ
			|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Остатки(, Склад = &Склад) КАК ТоварыКОформлению
			|	ГДЕ
			|		ТоварыКОформлению.КОформлениюАктовОстаток < 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыКОформлению.Номенклатура,
			|		ТоварыКОформлению.Характеристика,
			|		ТоварыКОформлению.Назначение,
			|		ТоварыКОформлению.КОформлениюАктов,
			|		ТоварыКОформлению.Серия
			|	ИЗ
			|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлению
			|	ГДЕ
			|		ТоварыКОформлению.Регистратор = &Ссылка
			|		И ТоварыКОформлению.Активность = ИСТИНА
			|		И ТоварыКОформлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ТоварыКОформлению
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыКОформлению.Номенклатура,
			|	ТоварыКОформлению.Характеристика,
			|	ТоварыКОформлению.Назначение,
			|	ТоварыКОформлению.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаИсходногоТовара.Номенклатура,
			|	ТаблицаИсходногоТовара.Характеристика,
			|	ЕСТЬNULL(ВЫБОР
			|		КОГДА &НаОснованииПересчета
			|			ТОГДА ПересчетТоваровТовары.Серия
			|		КОГДА &НаОснованииОрдера
			|			ТОГДА ОрдерНаОтражениеПорчиТоваровТовары.Серия
			|		ИНАЧЕ NULL
			|	КОНЕЦ, ТаблицаИсходногоТовара.Серия) КАК Серия,
			|	ТаблицаИсходногоТовара.Назначение,
			|	ТаблицаИсходногоТовара.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсходногоТовараСФильтром
			|ИЗ
			|	ТаблицаИсходногоТовара КАК ТаблицаИсходногоТовара
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
			|		ПО (&НаОснованииПересчета)
			|			И ТаблицаИсходногоТовара.Номенклатура = ПересчетТоваровТовары.Номенклатура
			|			И ТаблицаИсходногоТовара.Характеристика = ПересчетТоваровТовары.Характеристика
			|			И ТаблицаИсходногоТовара.Назначение = ПересчетТоваровТовары.Назначение
			|			И (ПересчетТоваровТовары.СтатусУказанияСерий <> 14
			|				ИЛИ ТаблицаИсходногоТовара.Серия = ПересчетТоваровТовары.Серия)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОрдерНаОтражениеПорчиТоваров.Товары КАК ОрдерНаОтражениеПорчиТоваровТовары
			|		ПО (&НаОснованииОрдера)
			|			И ТаблицаИсходногоТовара.Номенклатура = ОрдерНаОтражениеПорчиТоваровТовары.Номенклатура
			|			И ТаблицаИсходногоТовара.Характеристика = ОрдерНаОтражениеПорчиТоваровТовары.Характеристика
			|			И ТаблицаИсходногоТовара.Назначение = ОрдерНаОтражениеПорчиТоваровТовары.Назначение
			|			И (ОрдерНаОтражениеПорчиТоваровТовары.СтатусУказанияСерий <> 14
			|				ИЛИ ТаблицаИсходногоТовара.Серия = ОрдерНаОтражениеПорчиТоваровТовары.Серия)
			|ГДЕ
			|	(НЕ &НаОснованииПересчета
			|			ИЛИ &НаОснованииПересчета
			|				И НЕ ПересчетТоваровТовары.Номенклатура ЕСТЬ NULL 
			|				И ПересчетТоваровТовары.Ссылка = &ДокументОснование)
			|	И (НЕ &НаОснованииОрдера
			|			ИЛИ &НаОснованииОрдера
			|				И НЕ ОрдерНаОтражениеПорчиТоваровТовары.Номенклатура ЕСТЬ NULL 
			|				И ОрдерНаОтражениеПорчиТоваровТовары.Ссылка = &ДокументОснование)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаБракаСФильтром.Номенклатура КАК НоменклатураОприходование,
			|	ТаблицаБракаСФильтром.Характеристика КАК ХарактеристикаОприходование,
			|	ТаблицаБракаСФильтром.Назначение КАК НазначениеОприходование,
			|	ТаблицаИсходногоТовараСФильтром.Номенклатура КАК Номенклатура,
			|	ТаблицаИсходногоТовараСФильтром.Характеристика КАК Характеристика,
			|	ТаблицаИсходногоТовараСФильтром.Назначение КАК Назначение,
			|	ТаблицаИсходногоТовараСФильтром.Серия КАК Серия
			|ИЗ
			|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаБракаСФильтром КАК ТаблицаБракаСФильтром
			|		ПО ТоварыДругогоКачества.НоменклатураБрак = ТаблицаБракаСФильтром.Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсходногоТовараСФильтром КАК ТаблицаИсходногоТовараСФильтром
			|		ПО ТоварыДругогоКачества.Номенклатура = ТаблицаИсходногоТовараСФильтром.Номенклатура
			|ГДЕ
			|	НЕ &НаОснованииОрдера
			|	И ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовараСФильтром.Серия КАК Справочник.СерииНоменклатуры).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБракаСФильтром.Серия КАК Справочник.СерииНоменклатуры).Наименование, """")
			|	И ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовараСФильтром.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБракаСФильтром.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).Наименование, """")
			|	И (ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовараСФильтром.Назначение КАК Справочник.Назначения).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБракаСФильтром.Назначение КАК Справочник.Назначения).Наименование, """")
			|			ИЛИ ТаблицаБракаСФильтром.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОрдерНаОтражениеПорчиТоваровТовары.НоменклатураОприходование,
			|	ОрдерНаОтражениеПорчиТоваровТовары.ХарактеристикаОприходование,
			|	ВЫБОР
			|		КОГДА ОрдерНаОтражениеПорчиТоваровТовары.ПодНазначение
			|			ТОГДА ОрдерНаОтражениеПорчиТоваровТовары.Назначение
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|	КОНЕЦ,
			|	ОрдерНаОтражениеПорчиТоваровТовары.Номенклатура,
			|	ОрдерНаОтражениеПорчиТоваровТовары.Характеристика,
			|	ОрдерНаОтражениеПорчиТоваровТовары.Назначение,
			|	ОрдерНаОтражениеПорчиТоваровТовары.Серия
			|ИЗ
			|	Документ.ОрдерНаОтражениеПорчиТоваров.Товары КАК ОрдерНаОтражениеПорчиТоваровТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
			|		ПО ОрдерНаОтражениеПорчиТоваровТовары.Номенклатура = ТоварыДругогоКачества.Номенклатура
			|			И ОрдерНаОтражениеПорчиТоваровТовары.НоменклатураОприходование = ТоварыДругогоКачества.НоменклатураБрак
			|ГДЕ
			|	&НаОснованииОрдера
			|	И НЕ ТоварыДругогоКачества.Номенклатура ЕСТЬ NULL
			|	И ОрдерНаОтражениеПорчиТоваровТовары.Ссылка = &ДокументОснование
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	Назначение,
			|	Серия,
			|	НазначениеОприходование УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаБракаСФильтром.Номенклатура,
			|	ТаблицаБракаСФильтром.Характеристика,
			|	ТаблицаБракаСФильтром.Серия,
			|	ТаблицаБракаСФильтром.Назначение,
			|	ТаблицаБракаСФильтром.Количество
			|ИЗ
			|	ТаблицаБракаСФильтром КАК ТаблицаБракаСФильтром
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИсходногоТовараСФильтром.Номенклатура,
			|	ТаблицаИсходногоТовараСФильтром.Характеристика,
			|	ТаблицаИсходногоТовараСФильтром.Серия,
			|	ТаблицаИсходногоТовараСФильтром.Назначение,
			|	ТаблицаИсходногоТовараСФильтром.Количество
			|ИЗ
			|	ТаблицаИсходногоТовараСФильтром КАК ТаблицаИсходногоТовараСФильтром";
			
			НомерТаблицыСоответствий = 4;
			#Вставка
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"&НовыйРасчетОтклоненияБезУпаковок", 
			Документы.ПересчетТоваров.НовыйРасчетОтклонения_ПараметрЗапросаБезУпаковок("ПересчетТоваровТовары"));
			
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаКоэффициентУпаковки",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ПересчетТоваровТовары.Упаковка",
			"ПересчетТоваровТовары.Номенклатура"));
			#КонецВставки
			
		Иначе
			
			// На неордерном складе ДокументОснование будет только пересчет
			Запрос.Текст = 
			
			"ВЫБРАТЬ
			|	ТаблицаБрака.Номенклатура КАК Номенклатура,
			|	ТаблицаБрака.Характеристика КАК Характеристика,
			|	ТаблицаБрака.Назначение КАК Назначение,
			#Удаление
			|	ТаблицаБрака.КоличествоФакт - ТаблицаБрака.Количество КАК Количество,
			#КонецУдаления
			#Вставка
			|	&НовыйРасчетОтклоненияБезУпаковок1 КАК Количество,
			#КонецВставки
			|	ТаблицаБрака.Серия КАК Серия
			|ПОМЕСТИТЬ ТаблицаБрака
			|ИЗ
			|	Документ.ПересчетТоваров.Товары КАК ТаблицаБрака
			|ГДЕ
			#Удаление
			|	ТаблицаБрака.Количество - ТаблицаБрака.КоличествоФакт < 0
			#КонецУдаления
			#Вставка
			|	-&НовыйРасчетОтклоненияБезУпаковок1 < 0
			#КонецВставки
			|	И ТаблицаБрака.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИсходногоТовара.Номенклатура КАК Номенклатура,
			|	ТаблицаИсходногоТовара.Характеристика КАК Характеристика,
			|	ТаблицаИсходногоТовара.Назначение КАК Назначение,
			#Удаление
			|	ТаблицаИсходногоТовара.Количество - ТаблицаИсходногоТовара.КоличествоФакт КАК Количество,
			#КонецУдаления
			#Вставка
			|	-&НовыйРасчетОтклоненияБезУпаковок2 КАК Количество,
			#КонецВставки
			|	ТаблицаИсходногоТовара.Серия КАК Серия
			|ПОМЕСТИТЬ ТаблицаИсходногоТовара
			|ИЗ
			|	Документ.ПересчетТоваров.Товары КАК ТаблицаИсходногоТовара
			|ГДЕ
			#Удаление
			|	ТаблицаИсходногоТовара.Количество - ТаблицаИсходногоТовара.КоличествоФакт > 0
			#КонецУдаления
			#Вставка
			|	-&НовыйРасчетОтклоненияБезУпаковок2 > 0
			#КонецВставки
			|	И ТаблицаИсходногоТовара.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаБрака.Номенклатура КАК НоменклатураОприходование,
			|	ТаблицаБрака.Характеристика КАК ХарактеристикаОприходование,
			|	ТаблицаБрака.Назначение КАК НазначениеОприходование,
			|	ТаблицаИсходногоТовара.Номенклатура КАК Номенклатура,
			|	ТаблицаИсходногоТовара.Характеристика КАК Характеристика,
			|	ТаблицаИсходногоТовара.Назначение КАК Назначение,
			|	ТаблицаИсходногоТовара.Серия КАК Серия
			|ИЗ
			|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаБрака КАК ТаблицаБрака
			|		ПО ТоварыДругогоКачества.НоменклатураБрак = ТаблицаБрака.Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИсходногоТовара КАК ТаблицаИсходногоТовара
			|		ПО ТоварыДругогоКачества.Номенклатура = ТаблицаИсходногоТовара.Номенклатура
			|ГДЕ
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовара.Серия КАК Справочник.СерииНоменклатуры).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБрака.Серия КАК Справочник.СерииНоменклатуры).Наименование, """")
			|	И ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовара.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБрака.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).Наименование, """")
			|	И (ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаИсходногоТовара.Назначение КАК Справочник.Назначения).Наименование, """") = ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаБрака.Назначение КАК Справочник.Назначения).Наименование, """")
			|			ИЛИ ТаблицаБрака.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	Назначение,
			|	Серия,
			|	НазначениеОприходование УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаБрака.Номенклатура,
			|	ТаблицаБрака.Характеристика,
			|	ТаблицаБрака.Назначение,
			|	ТаблицаБрака.Количество,
			|	ТаблицаБрака.Серия
			|ИЗ
			|	ТаблицаБрака КАК ТаблицаБрака
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаИсходногоТовара.Номенклатура,
			|	ТаблицаИсходногоТовара.Характеристика,
			|	ТаблицаИсходногоТовара.Назначение,
			|	ТаблицаИсходногоТовара.Количество,
			|	ТаблицаИсходногоТовара.Серия
			|ИЗ
			|	ТаблицаИсходногоТовара КАК ТаблицаИсходногоТовара";
			#Вставка
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"&НовыйРасчетОтклоненияБезУпаковок1", 
			Документы.ПересчетТоваров.НовыйРасчетОтклонения_ПараметрЗапросаБезУпаковок("ТаблицаБрака", "&ТекстЗапросаКоэффициентУпаковки1"));
			
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"&НовыйРасчетОтклоненияБезУпаковок2", 
			Документы.ПересчетТоваров.НовыйРасчетОтклонения_ПараметрЗапросаБезУпаковок("ТаблицаИсходногоТовара", "&ТекстЗапросаКоэффициентУпаковки2"));
			
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаБрака.Упаковка",
			"ТаблицаБрака.Номенклатура"));
			
			Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаИсходногоТовара.Упаковка",
			"ТаблицаИсходногоТовара.Номенклатура"));
			#КонецВставки
			
			Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
			
			НомерТаблицыСоответствий = 2;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);
		
		ТаблицаСоответствий = Результат[НомерТаблицыСоответствий].Выгрузить();
		ТаблицаПриходуемыхТоваров = Результат[НомерТаблицыСоответствий + 1].Выгрузить();
		ТаблицаСписываемыхТоваров = Результат[НомерТаблицыСоответствий + 2].Выгрузить();
		
		Для Каждого СтрокаСписываемыйТовар Из ТаблицаСписываемыхТоваров Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", 		СтрокаСписываемыйТовар.Номенклатура);
			Отбор.Вставить("Характеристика", 	СтрокаСписываемыйТовар.Характеристика);
			Отбор.Вставить("Назначение", 		СтрокаСписываемыйТовар.Назначение);
			Отбор.Вставить("Серия", 			СтрокаСписываемыйТовар.Серия);
			СоответствиеСТоварамиДругогоКачества = ТаблицаСоответствий.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаТоварДругогоКачества Из СоответствиеСТоварамиДругогоКачества Цикл
				
				Если СтрокаСписываемыйТовар.Количество = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Отбор.Очистить();
				Отбор.Вставить("Номенклатура", 		СтрокаТоварДругогоКачества.НоменклатураОприходование);
				Отбор.Вставить("Характеристика", 	СтрокаТоварДругогоКачества.ХарактеристикаОприходование);
				Отбор.Вставить("Назначение", 		СтрокаТоварДругогоКачества.НазначениеОприходование);
				Отбор.Вставить("Серия", 			СтрокаТоварДругогоКачества.Серия);
				МассивПриходуемыхТоваров = ТаблицаПриходуемыхТоваров.НайтиСтроки(Отбор);
				
				МассивСтрокПриходуемыхТоваровКУдалению = Новый Массив;
				
				Для Каждого СтрокаПриходуемыйТовар Из МассивПриходуемыхТоваров Цикл
					
					Если СтрокаСписываемыйТовар.Количество = 0 Тогда
						Прервать;
					КонецЕсли;
					
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.Номенклатура 				= СтрокаСписываемыйТовар.Номенклатура;
					НоваяСтрока.Характеристика 				= СтрокаСписываемыйТовар.Характеристика;
					НоваяСтрока.Назначение 					= СтрокаСписываемыйТовар.Назначение;
					НоваяСтрока.Серия 						= СтрокаСписываемыйТовар.Серия;
					НоваяСтрока.НоменклатураОприходование 	= СтрокаПриходуемыйТовар.Номенклатура;
					НоваяСтрока.ХарактеристикаОприходование	= СтрокаПриходуемыйТовар.Характеристика;
					НоваяСтрока.ПодНазначение 				= ЗначениеЗаполнено(СтрокаПриходуемыйТовар.Назначение);
					
					НоваяСтрока.Количество = Мин(СтрокаПриходуемыйТовар.Количество, СтрокаСписываемыйТовар.Количество);
					
					СтрокаПриходуемыйТовар.Количество = СтрокаПриходуемыйТовар.Количество - НоваяСтрока.Количество;
					СтрокаСписываемыйТовар.Количество = СтрокаСписываемыйТовар.Количество - НоваяСтрока.Количество;
					
					Если СтрокаПриходуемыйТовар.Количество = 0 Тогда
						МассивСтрокПриходуемыхТоваровКУдалению.Добавить(СтрокаПриходуемыйТовар);
					КонецЕсли;
					
				КонецЦикла;
				
				УдалитьСтрокиИзТаблицы(ТаблицаПриходуемыхТоваров, МассивСтрокПриходуемыхТоваровКУдалению);		
				
			КонецЦикла;
			
			УдалитьСтрокиИзТаблицы(ТаблицаСоответствий, СоответствиеСТоварамиДругогоКачества);
			
		КонецЦикла;
		
		Если Товары.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(ВидЦены) И Товары.Количество() > 0 И Не ПриходоватьТоварыПоСебестоимостиСписания Тогда
				
				КолонкиПоЗначению = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
				ДругиеИменаКолонок = Новый Структура("НоменклатураОприходование, ХарактеристикаОприходование", "Номенклатура", "Характеристика");
				
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("Дата",				Дата);
				ПараметрыЗаполнения.Вставить("Организация",			Организация);
				ПараметрыЗаполнения.Вставить("Валюта",				Валюта);
				ПараметрыЗаполнения.Вставить("ВидЦены",				ВидЦены);
				ПараметрыЗаполнения.Вставить("КолонкиПоЗначению",	КолонкиПоЗначению);
				ПараметрыЗаполнения.Вставить("ДругиеИменаКолонок",	ДругиеИменаКолонок);
				
				ЦеныПредприятияЗаполнениеСервер.ЗаполнитьЦены(
				Товары, // Табличная часть
				, // Выделенные строки (заполнять во всех строках)
				ПараметрыЗаполнения);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ТекстСообщения = НСтр("ru = 'В документе ""%ДокументОснование%"" отсутствуют товары, по которым необходимо оформить порчу.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументОснование%", ДокументОснование);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецПроцедуры
	
#КонецЕсли
